stefanu21/cc3200/httpserver/main.c
}
static _u8 get_server_resp(unsigned char *ptr, char *led, _u16 len, int value) {
	int status = value > 0 ? 1 : 0;
	_u8 tmp = 0, ret_len = 0;

	memcpy(ptr, led, len);
	ptr += len;
	ret_len += len;
	if (status) {
		tmp = strlen(LED_ON_STRING);
		memcpy(ptr, LED_ON_STRING, tmp);
	} else {
		tmp = strlen(LED_OFF_STRING);
		memcpy(ptr, LED_OFF_STRING, tmp);
	}
	ptr += tmp;
	ret_len += tmp;
	return ret_len;
}

static int calc_dim_value(int *dim, unsigned char *value, unsigned char len) {

	if (!dim || !value || !len)
		return -1;

	if (memcmp(value, LED_POS_DIM_STRING, len) == 0) {
		*dim += DIM_INC;
		Report("Led dim pos\n\r");
	} else {
		*dim -= DIM_INC;
		Report("Led dim neg\n\r");
	}

	if (*dim >= 254)
		*dim = 254;
	else if (*dim <= 0)
		*dim = 0;

	return 0;
}
//*****************************************************************************
//
//! This function gets triggered when HTTP Server receives Application
//! defined GET and POST HTTP Tokens.
//!
//! \param pHttpServerEvent Pointer indicating http server event
//! \param pHttpServerResponse Pointer indicating http server response
//!
//! \return None
//!
//*****************************************************************************
void SimpleLinkHttpServerCallback(SlHttpServerEvent_t *pSlHttpServerEvent, 
                               SlHttpServerResponse_t *pSlHttpServerResponse)
{
    unsigned char strLenVal = 0;

    if(!pSlHttpServerEvent || !pSlHttpServerResponse)
    {
        return;
    }
    
    switch (pSlHttpServerEvent->Event) {
		case SL_NETAPP_HTTPGETTOKENVALUE_EVENT: {
			unsigned char *ptr;

			ptr = pSlHttpServerResponse->ResponseData.token_value.data;
			pSlHttpServerResponse->ResponseData.token_value.len = 0;

			if (memcmp(pSlHttpServerEvent->EventData.httpTokenName.data, GET_token,
					strlen((const char *) GET_token)) == 0) {
				pSlHttpServerResponse->ResponseData.token_value.len =
						get_server_resp(ptr, LED1_STRING, strlen(LED1_STRING),
								dimpos1);
				pSlHttpServerResponse->ResponseData.token_value.len +=
						get_server_resp(ptr, LED2_STRING, strlen(LED2_STRING),
								dimpos2);
				pSlHttpServerResponse->ResponseData.token_value.len +=
						get_server_resp(ptr, LED3_STRING, strlen(LED3_STRING),
								dimpos3);
				pSlHttpServerResponse->ResponseData.token_value.len +=
						get_server_resp(ptr, LED4_STRING, strlen(LED4_STRING),
								dimpos4);
				*ptr = '\0';
			}

		}
        break;

        case SL_NETAPP_HTTPPOSTTOKENVALUE_EVENT:
        {
          unsigned char led;
          unsigned char *ptr = pSlHttpServerEvent->EventData.httpPostData.token_name.data;


          if(memcmp(ptr, POST_DIM_token, strlen((const char *)POST_DIM_token)) == 0)
          {
            ptr = pSlHttpServerEvent->EventData.httpPostData.token_value.data;
            strLenVal = strlen(LED_STRING);
            if(memcmp(ptr, LED_STRING, strLenVal) != 0)
              break;
            ptr += strLenVal;
            led = *ptr;
            strLenVal = strlen(LED_POS_DIM_STRING);
			ptr += 2;  // nr + _

			switch (led) {
			case '1':
				if (led1_status) {
					calc_dim_value(&dimpos1, ptr, strLenVal);
					UpdateDutyCycle(TIMERA3_BASE, TIMER_B, dimpos1);
				}
				break;
			case '2':
				if (led2_status) {
					calc_dim_value(&dimpos2, ptr, strLenVal);
					UpdateDutyCycle(TIMERA3_BASE, TIMER_A, dimpos2);
				}
				break;
			case '3':
				if (led3_status) {
					calc_dim_value(&dimpos3, ptr, strLenVal);
					UpdateDutyCycle(TIMERA2_BASE, TIMER_B, dimpos3);
				}
				break;
			case '4':
				if (led4_status) {
					calc_dim_value(&dimpos4, ptr, strLenVal);
					UpdateDutyCycle(TIMERA0_BASE, TIMER_A, dimpos4);
				}
				break;
			default:
				Report("led unknown");
				break;
			}
          }

          if(memcmp(ptr, POST_token, strlen((const char *)POST_token)) == 0)
          {
            ptr = pSlHttpServerEvent->EventData.httpPostData.token_value.data;
            strLenVal = strlen(LED_STRING);
            if(memcmp(ptr, LED_STRING, strLenVal) != 0)
              break;
            ptr += strLenVal;
            led = *ptr;
            strLenVal = strlen(LED_ON_STRING);
			ptr += 2; // nr + _

			switch (led) {
			case '1':
				if (memcmp(ptr, LED_ON_STRING, strLenVal) == 0) {
		            UpdateDutyCycle(TIMERA3_BASE, TIMER_B, dimpos1);
					Report("Led 1 On\n\r");
					led1_status = 1;
				} else {
		            UpdateDutyCycle(TIMERA3_BASE, TIMER_B, 0);
					Report("Led 1 Off\n\r");
					led1_status = 0;
				}
				break;
			case '2':
				if (memcmp(ptr, LED_ON_STRING, strLenVal) == 0) {
		            UpdateDutyCycle(TIMERA3_BASE, TIMER_A, dimpos2);
					Report("Led 2 On\n\r");
					led2_status = 1;
				} else {
		            UpdateDutyCycle(TIMERA3_BASE, TIMER_A, 0);
					Report("Led 2 Off\n\r");
					led2_status = 0;
				}
				break;
			case '3':
				if (memcmp(ptr, LED_ON_STRING, strLenVal) == 0) {
		            UpdateDutyCycle(TIMERA2_BASE, TIMER_B, dimpos3);
					Report("Led 3 On\n\r");
					led3_status = 1;
				} else {
		            UpdateDutyCycle(TIMERA2_BASE, TIMER_B, 0);
					Report("Led 3 Off\n\r");
					led3_status = 0;
				}
				break;
			case '4':
				if (memcmp(ptr, LED_ON_STRING, strLenVal) == 0) {
		            UpdateDutyCycle(TIMERA0_BASE, TIMER_A, dimpos4);
					Report("Led 4 On\n\r");
					led4_status = 1;
				} else {
		            UpdateDutyCycle(TIMERA0_BASE, TIMER_A, 0);
					Report("Led 4 Off\n\r");
					led4_status = 0;
				}
				break;
			default:
				Report("led unknown");
				break;
			}

		    WriteFileToDevice();
		}
	}
		break;
	default:
		break;
    }
}


//*****************************************************************************
//
//! \brief This function initializes the application variables
//!
//! \param    None
//!
//! \return None
//!
//*****************************************************************************
static void InitializeAppVariables()
{
    g_ulStatus = 0;
    g_uiIpAddress = 0;
}


//*****************************************************************************
//! \brief This function puts the device in its default state. It:
//!           - Set the mode to STATION
//!           - Configures connection policy to Auto and AutoSmartConfig
//!           - Deletes all the stored profiles
//!           - Enables DHCP
//!           - Disables Scan policy
//!           - Sets Tx power to maximum
//!           - Sets power policy to normal
//!           - Unregister mDNS services
//!           - Remove all filters
//!
//! \param   none
//! \return  On success, zero is returned. On error, negative is returned
//*****************************************************************************
static long ConfigureSimpleLinkToDefaultState()
{
    SlVersionFull   ver = {0};
    _WlanRxFilterOperationCommandBuff_t  RxFilterIdMask = {0};

    unsigned char ucVal = 1;
    unsigned char ucConfigOpt = 0;
    unsigned char ucConfigLen = 0;
    unsigned char ucPower = 0;

    long lRetVal = -1;
    long lMode = -1;

    lMode = sl_Start(0, 0, 0);
    ASSERT_ON_ERROR(lMode);

    // If the device is not in station-mode, try configuring it in station-mode 
    if (ROLE_STA != lMode)
    {
        if (ROLE_AP == lMode)
        {
            // If the device is in AP mode, we need to wait for this event 
            // before doing anything 
            while(!IS_IP_ACQUIRED(g_ulStatus))
            {
#ifndef SL_PLATFORM_MULTI_THREADED
              _SlNonOsMainLoopTask(); 
#endif
            }
        }

        // Switch to STA role and restart 
        lRetVal = sl_WlanSetMode(ROLE_STA);
        ASSERT_ON_ERROR(lRetVal);

        lRetVal = sl_Stop(0xFF);
        ASSERT_ON_ERROR(lRetVal);

        lRetVal = sl_Start(0, 0, 0);
        ASSERT_ON_ERROR(lRetVal);

        // Check if the device is in station again 
        if (ROLE_STA != lRetVal)
        {
        	Report("device not in station mode");
            // We don't want to proceed if the device is not coming up in STA-mode 
            return DEVICE_NOT_IN_STATION_MODE;
        }
    }
    
    // Get the device's version-information
    ucConfigOpt = SL_DEVICE_GENERAL_VERSION;
    ucConfigLen = sizeof(ver);
    lRetVal = sl_DevGet(SL_DEVICE_GENERAL_CONFIGURATION, &ucConfigOpt, 
                                &ucConfigLen, (unsigned char *)(&ver));
    ASSERT_ON_ERROR(lRetVal);
    
    UART_PRINT("Host Driver Version: %s\n\r",SL_DRIVER_VERSION);
    UART_PRINT("Build Version %d.%d.%d.%d.31.%d.%d.%d.%d.%d.%d.%d.%d\n\r",
    ver.NwpVersion[0],ver.NwpVersion[1],ver.NwpVersion[2],ver.NwpVersion[3],
    ver.ChipFwAndPhyVersion.FwVersion[0],ver.ChipFwAndPhyVersion.FwVersion[1],
    ver.ChipFwAndPhyVersion.FwVersion[2],ver.ChipFwAndPhyVersion.FwVersion[3],
    ver.ChipFwAndPhyVersion.PhyVersion[0],ver.ChipFwAndPhyVersion.PhyVersion[1],
    ver.ChipFwAndPhyVersion.PhyVersion[2],ver.ChipFwAndPhyVersion.PhyVersion[3]);

    // Set connection policy to Auto + SmartConfig 
    //      (Device's default connection policy)
    lRetVal = sl_WlanPolicySet(SL_POLICY_CONNECTION, 
                                SL_CONNECTION_POLICY(1, 0, 0, 0, 1), NULL, 0);
    ASSERT_ON_ERROR(lRetVal);

